АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/CommonModules/РфпРаботаСДокументами/Module.bsl
Процедура ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти) Экспорт
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		// получить припуск, вычислить объем, прибавить к объему характеристики. 
				  		 
			
		Если СтрокаТабличнойЧасти.Свойство("Припуск") Тогда		// проверка наличия припуска 		
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Припуск) Тогда    
				
				ПараметрыПрипуска = РфпПолучениеДанныхСервер.ОбъемПрипуска(СтрокаТабличнойЧасти.Припуск);
				
				ПараметрыХ = РфпПолучениеДанныхСервер.ПараметрыХарактеристики(СтрокаТабличнойЧасти.Характеристика);
				
				ДлинаММ 	= ПараметрыХ.ДлинаММ;
				ШиринаММ  	= ПараметрыХ.ШиринаММ;
				ТолщинаММ	= ПараметрыХ.ТолщинаММ;   			
				
				ОбъемПоХарактеристике =  (ДлинаММ + ПараметрыПрипуска.ПрипускПоДлине)/1000 * (ШиринаММ + ПараметрыПрипуска.ПрипускПоШирине)/1000 * (ТолщинаММ + ПараметрыПрипуска.ПрипускПоТолщине)/1000; 
				
				СтрокаТабличнойЧасти.ОбъемСПрипуском = ОбъемПоХарактеристике * СтрокаТабличнойЧасти.Количество;  		
				
			КонецЕсли;			
		КонецЕсли;
	
		СтрокаТабличнойЧасти.Объем =  РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		СтрокаТабличнойЧасти.Объем = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.Количество;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПересчитатьОбъемСтрокиФакт(СтрокаТабличнойЧасти) Экспорт
	
	КатегорияНоменклатуры = РфпПолучениеДанныхСервер.КатегорияНоменклатурыНаСервере(СтрокаТабличнойЧасти.Номенклатура);
	
	Если КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиловочник") Тогда
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;	
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Пиломатериал") Тогда 
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоХарактеристике(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;
		
	ИначеЕсли КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.Окорка")  Тогда 
		
		СтрокаТабличнойЧасти.ОбъемФакт = РфпПолучениеДанныхСервер.ОбъемПоКубатурнику(СтрокаТабличнойЧасти.Характеристика) * СтрокаТабличнойЧасти.КоличествоФакт;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПересчитатьОбъемСтрокиПоВесу(СтрокаТабличнойЧасти) Экспорт
	
	Плотность = РфпПолучениеДанныхСервер.ПлотностьНоменклатуры(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.Характеристика);
	
	СтрокаТабличнойЧасти.ОбъемТаможня = ?(Плотность <> 0, СтрокаТабличнойЧасти.ВесНетто * 1000/Плотность, СтрокаТабличнойЧасти.ОбъемТаможня);

КонецПроцедуры

Процедура ПриИзмененииДатыДокумента(ОбъектФормы, ДатаВремя) Экспорт
	Результат = новый структура("Смена, ДатаСмены");
	ЧасДаты = Час(ДатаВремя);
	Результат.ДатаСмены = ?(ЧасДаты >= 8
			, НачалоДня(ДатаВремя), НачалоДня(ДатаВремя - 86400));
	Результат.Смена 	= ?(ЧасДаты >= 8 и ЧасДаты <= 20
			, ПредопределенноеЗначение("Перечисление.Смены.смена_8_20"), ПредопределенноеЗначение("Перечисление.Смены.смена_20_8"));
	ЗаполнитьЗначенияСвойств(ОбъектФормы, Результат, "ДатаСмены,Смена");
КонецПроцедуры


//&НаСервере
//Функция РфпПолучениеДанныхСервер.ПолучитьПараметрыПрипуска(Припуск) 
//	
//	Возврат РфпСервер.ПолучитьПараметрыПрипуска(Припуск);	

//КонецФункции // ПолучитьПараметрыПрипуска()
